Revit 2024 API
BaseExportOptions.PropOverrides Property
 How to export overridden object styles. Default value is PropOverrideMode.ByEntity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public PropOverrideMode PropOverrides { get; set; }
Visual Basic
Public Property PropOverrides As PropOverrideMode
	Get
	Set
Visual C++
public:
property PropOverrideMode PropOverrides {
	PropOverrideMode get ();
	void set (PropOverrideMode value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace